Autodesk.Revit.DB.BuiltInFailures.SystemNavigatorFailures.MultipleSelectNumberIsWrong
The selected tree nodes number of system browser is wrong.

Autodesk.Revit.DB.BuiltInFailures.SystemNavigatorFailures.CannottFindCorrectTreeNode
Can't find the correct tree node in system browser according to the node index.

Autodesk.Revit.DB.BuiltInFailures.SystemNavigatorFailures
Failures related with the system browser.